# ++++++++++   2.3.1变量   ++++++++++
# data = 100
# print(data)


# ++++++++++   2.3.2数据类型   ++++++++++
# 0            	# 整型
# 101           	# 整型
# -239          	# 整型
# 3.1415       	# 浮点型
# 4.2E-10      	# 浮点型
# -2.334E-9   	# 浮点型
# 3.12+1.23j 	# 复数类型
# -1.23-93j   	# 复数类型
# True        	# 布尔类型
# False       	# 布尔类型


'Python123￥'  		                                 # 使用单引号包裹
"Python4*&%"			                             # 使用双引号包裹
'''Python s1 ~(())'''		                         # 使用三引号包裹


# [1, 2, 'apple']		                            # 这是一个列表

# (1, 2, 'apple') 									# 这是一个元组

# {'apple', 'orange', 1}  							# 这是一个集合

# {"name": "张三", "age": 18}                        # 这是一个字典


# ++++++++++   多学一招：type()函数   ++++++++++
# dict_demo = {"name": "zhangsan", "age": 18}
# print(type(dict_demo))                            # 查看数据类型


# ++++++++++   2.3.3变量的输入与输出   ++++++++++
# user_name = input('请输入账号：')      # 接收用户输入的账号
# password = input('请输入密码：')       # 接收用户输入的密码
# print('登录成功！')

# name = '小明'
# print('姓名：', name)     	# 输出多个数据，第一个是字符串类型的数据，第二个是变量保存的数据
# print('年龄: 22')         	# 输出一个字符串类型的数据
# address = '北京'
# print('地址：', address) 	# 输出多个数据，第一个是字符串类型的数据，第二个是变量保存的数据



