# ++++++++++   2.6.1算术运算符	   ++++++++++
# print(10 / 2.0)  						# 整型数据10会转换为浮点型的数据10.0
# print(10 - (3 + 5j))  				# 整型数据10会转换为复数类型的数据10+0j


# ++++++++++   2.6.2赋值运算符   ++++++++++
# num = 3
# x = y = z = 1  						# 变量x、y、z均赋值为1
# a, b = 1, 2  						# 变量a赋值为1，变量b赋值为2
#
# num_one = 1
# result = num_one + (num_two:=2)  	# 使用海象运算符为变量num_two赋值
# print(result)



# ++++++++++   2.6.5成员运算符   ++++++++++
# x = 'Python'
# y = 'P'
# print(y in x)
# print(y not in x)


# ++++++++++   2.6.6位运算符   ++++++++++
# a = 9
# print(bin(a<<4))                    # 使用<<将变量a的值按位左移4位

# a = 8
# print(bin(a>>2))                   # 使用>>将变量a的值按位右移2位

# a = 9
# b = 3
# print(bin(a&b))                    # 使用&将变量a和b的值进行按位与运算

# a = 8
# b = 3
# print(bin(a|b))                   # 使用|将变量a和b的值进行按位或运算

# a = 8
# b = 4
# print(bin(a^b))                    # 使用^将变量a和b的值进行按位异或运算

# a = 9
# print(bin(~a))                     # 使用～将变量a的值进行按位取反运算

# ++++++++++   2.6.7运算符优先级   ++++++++++
# a = 20
# b = 2
# c = 15
# result_01 = (a - b) + c  				# 先执行小括号中的表达式，再执行加法运算
# result_02 = a / b % c	  			# 先执行除法运算，再执行取余运算
# result_03 = c ** b * a 	  			# 先执行幂运算，再执行乘法运算
# print(result_01)
# print(result_02)
# print(result_03)

