# goods_name = input("请输入选购商品的名称：")
# goods_num = input("请输入选购商品的数量：")
# receiver_name = input("请输入收货人的姓名：")
# receiver_phone = input("请输入收货人的联系方式：")
# receiver_address = input("请输入收货人的地址：")
# print("===================================")
# print("   姓名：", receiver_name)
# print("联系方式：", receiver_phone)
# print("   地址：", receiver_address)
# print("-----------------------------------")
# print("商品名称：", goods_name)
# print("商品数量：", goods_num)
# print("商品总价：", 49500.00)
# print("   运费：", "￥0.00")
# print("  实付款：", "￥49500.00")
# print("-----------------------------------")
# print("订单编号：", 1023456789012345678)
# print("交易时间：", "2023-11-11 12:00:00")
# print("===================================")
# 请输入选购商品的名称：联想小新16英寸笔记本电脑
# 请输入选购商品的数量：10
# 请输入收货人的姓名：小智
# 请输入收货人的联系方式：13999999999
# 请输入收货人的地址：北京市昌平区金燕龙写字楼



nickname = input("请输入您的昵称：")
plant = input("请输入您要种植的植物：")


print("               植树证书                ")
print("-------------------------------------")
print(nickname, "谢谢你：           ")
print("   你申请种植的", plant, "，将由伊利\n"
      "公益基金会负责种下。查看种植进程>")
print()
print("树苗编号：NO.HBI66308960305")
print("申请时间：2023年11月10日")
print("种植地点：鄂尔多斯")
print("-------------------------------------")
