# t1 = ()						# 创建空元组，结果为()
# t2 = (1,)					# 创建包含单个元素的元组，结果为(1,)
# t3 = (1, 2, 3)				# 创建包含多个元素的元组，结果为(1, 2, 3)
# t4 = (1, 'c', ('e',2))		#元组嵌套，结果为(1, 'c', ('e', 2))

# t1 = tuple()		           	# 创建空元组，结果为()
t2 = tuple([1, 2, 3])	  	# 利用列表创建元组，结果为(1, 2, 3)
# 利用字符串创建元组，结果为('p', 'y', 't', 'h', 'o', 'n')
t3 = tuple('python')
# t4 = tuple(range(5))       	# 利用可迭代对象创建元组，结果为(0, 1, 2, 3, 4)

#
# print(t2[1])					# 以索引的方式访问元组元素
# print(t3[2:5])				# 以切片的方式访问元组元素
# for data in t3:				# 通过循环遍历元组的元素
#     print(data,end=' ')

